/*
Задачка про хождением конем.
Схематичное решение. 
Задачка - вы находидитесь в определенных координатах массива, посчитать куда можно перейти
Решение схематичное, накидал на листочке.
Пример хода: 2 вправо, 1 вниз
*/

function res(xy)
{
  console.log('Ход возможен x:'+xx.x + " y:"+xy.y);
}

function r(_x,_y)
{
  _init();

  if(_x+2<8 && y+1<8)
  {
    res({x:x+2,y:y+1});
  }
  if(_x+2<8 && y-1>=0)
  {
    res({x:x+2,y:y-1});
  }
  if(_x-2<8 && y+1<8)
  {
    res({x:x-2,y:y+1});
  }
  if(_x-2<8 && y-1>=0)
  {
    res({x:x-2,y:y-1});
  }

  if(_x+1<8 && y+2<8)
  {
    res({x:x+1,y:y+2});
  }
  if(_x+1<8 && y-2>=0)
  {
    res({x:x+1,y:y-2});
  }
  
  if(_x-1<8 && y+2<8)
  {
    res({x:x-1,y:y+2});
  }
  if(_x-1<8 && y-2>=0)
  {
    res({x:x-1,y:y-2});
  }
}

r();
