/*Первое задание — знакомство со средой выполнения и принципом работы.
Во всех заданиях для расчета результата мы учитываем только корректность решения (прохождение тест-кейсов). 
Оптимальность алгоритма и затраты памяти не учитываются. Тем не менее ваш код будут просматривать, поэтому оптимальные и изящные решения выделят вас на фоне других.
Ваш код должен успешно пройти автотесты для перехода к следующему заданию.

Задача
Напишите функцию, которая принимает предложение и возвращает количество содержащихся в нем четырехбуквенных слов.
Входной аргумент sentence — строка со словами, разделенными пробелами без пунктуации.
Пример
sentence = "This sentence is fine"
fourletters(sentence) = 2
*/

/**
 * Реализуйте функцию fourLetters
 */
function fourLetters(sentence: string): number {
    let counter = 0;
    const arr:Array<string> = sentence.split(' ')
    for (const el of arr) {
        if(el.length === 4)
         counter++
    }

    return counter
}

sentence = "This sentence is fine"
alert(fourLetters(sentence)) // 2
