/*
Необходимо написать функцию, которая на вход принимает урл,
асинхронно ходит по этому урлу GET запросом и возвращает данные (json).
Для получении данных можно использовать $.get или fetch.
Если во время запроса произошла ошибка, то пробовать запросить ещё 5 раз.
Если в итоге информацию получить не удалось, вернуть ошибку "Заданный URL недоступен".
*/


function getResource(url) {
fetch('http://example.com/movies.json')
  .then((response) => {
    return response.json();
  })
  .then((data) => {
    console.log(data);
  });
}

